<?php
// 8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».

$subject = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская область" => ["Касимов", "Кораблино", "Михайлов", "Новомичуринск", "Рыбное"]
];

//echo "<pre>";
//print_r($subject);
//echo "</pre>";

foreach ($subject as $item => $towns) {
    echo "$item :<br>";
    foreach ($towns as $key) {
        if (mb_substr($key, "0", 1) == "К") {
            echo "$key";
        }
        if ($towns[count($towns) - 1] != $key) {
            echo ", ";
        }
    }
    echo "<br>";
}

?>