<?php
//  1. Создать модуль корзины. В нее можно добавлять товары, а можно удалять.
//  user(id, user_id, name, login, pass, email, time_create);
//  cart(id, user_id, good_id, count, time_add);
//  good(id, img, short_info, full_info, count, price);
//
//  Использовать сущность good в качестве товара.
//
//  2. Создать модуль личного кабинета, на который будет перенаправляться пользователь после логина. Вывести там имя,
//  логин и приветствие.
//
//  3. *Создать модуль регистрации пользователя (см. ссылку в доп. материалах).
//
?>
